Repository: ViliusP/brewing_kettle
Catalog: web/assets/lang/*.arb
Languages: lt

# generalDate
source: Date
lt: Data

# generalTemperature
source: Temperature
lt: Temperatūra

# generalTargetTemperature
source: Target temperature
lt: Tikslo temperatūra

# generalPower
source: Power
lt: Galia

# generalError
source: Error
lt: Klaida

# generalInfo
source: Info
lt: Informacija

# generalSuccess
source: Success
lt: Įvykdyta

# generalWarning
source: Warning
lt: Įspėjimas

# generalVersion
source: Version
lt: Versija

# generalSave
source: Save
lt: Išsaugoti

# generalChange
source: Change
lt: Pakeisti

# generalLogout
source: Logout
lt: Atsijungti

# generalExit
source: Exit
lt: Išeiti

# generalGoBack
source: Go Back
lt: Grįžti Atgal

# formValidationRequired
source: This field is required
lt: Šis laukelis privalomas

# formValidationMustBeNumber
source: This field must be a number
lt: Šiame laukelyje turi būti skaičius

# formValidationMustBePositive
source: This field must be positive
lt: Šiame laukelyje turi būti teigiamas skaičius

# formValidationMustBeGreaterThan
source: This field must be greater than {value}
lt: Reikšmė turi būti didesnė nei {value}

# formValidationMustBeNotGreaterThan
source: This field must be not greater than {value}
lt: Reikšmė turi būti ne didesnė nei {value}

# formValidationMustBeLessThan
source: This field must be less than {value}
lt: Reikšmė turi būti mažesnė nei {value}

# formValidationMustBeNotLessThan
source: This field must be not less than {value}
lt: Reikšmė turi būti ne mažesnė nei {value}

# exceptionUnknown
source: Unknown error occurred.
lt: Įvyko nežinoma klaida.

# exceptionFailedToConnectToDevice
source: Failed to connect to device.
lt: Nepavyko prisijungti prie įrenginio.

# exceptionDeviceConnectionTimeout
source: Failed to connect to the device. Please check device or provided address
lt: Nepavyko prisijungti prie įrenginio. Patikrinkite įrenginį ar pateiktą adresą.

# exceptionAddressLookupFailed
source: Failed to connect to device. Bad address provided for kettle device.
lt: Nepavyko prisijungti prie įrenginio. Patikrinkite interneto ryšį ar pateiktą įrenginio adresą.

# exceptionConnectionRefused
source: Failed to connect to device. Device refused connection. Please check your provided address.
lt: Nepavyko prisijungti prie įrenginio. Patikrinkite pateiktą įrenginio adresą.

# exceptionHttpConnectionTimeout
source: Request to device's server timed out. Please check your internet connection.
lt: Laikas užklausai į įrenginio serverį baigėsi. Patikrinkite tinklo ryšį.

# exceptionHttpSendTimeout
source: Request to device's server timed out. Please check your internet connection.
lt: Laikas užklausai į įrenginio serverį baigėsi. Patikrinkite tinklo ryšį.

# exceptionHttpReceiveTimeout
source: Request to device's server timed out. Please check your internet connection.
lt: Laikas užklausai gauti iš įrenginio serverio baigėsi. Patikrinkite tinklo ryšį.

# exceptionHttpBadCertificate
source: Request failed. Bad certificate provided for device's server. This should not happen.
lt: Užklausa nepavyko. Blogas sertifikatas buvo pateiktas serveriui. Ši klaida neturėjo nutikti. Apie tai praneškite programinės įrangos kurėjams.

# exceptionHttpBadResponse
source: Unexpected response ({code}). Request failed. This should not happen.
lt: Netikėtas atsakas iš įrenginio serverio ({code}). Užklausa nepavyko. Ši klaida neturėjo nutikti. Apie tai praneškite programinės įrangos kurėjams.

# exceptionHttpCancel
source: Request was cancelled. This should not happenn.
lt: Užklausa buvo atšaukta. Ši klaida neturėjo nutikti. Apie tai praneškite programinės įrangos kurėjams.

# exceptionHttpConnectionError
source: Failed to connect to device's server. Please check your internet connection.
lt: Nepavyko prisijungti prie įrenginio serverio. Patikrinkite tinklo ryšį.

# exceptionHttpUnknown
source: Unexpected network error occurred. There may be a problem with your internet connection or device's server.
lt: Įvyko netikėta tinklo problema. Tai gali būti interneto ryšio arba įrenginio serverio sutrikimai.

# connectButtonLabel
source: Connect
lt: Prisijungti

# scanButtonLabel
source: Scan
lt: Ieškoti

# deviceIpAddressFormLabel
source: Device IP address
lt: Įrenginio IP adresas

# deviceIpAddressFormHelper
source: For example: "{address}"
lt: Pavyzdžiui: "{address}"

# deviceIpFormValidationRequired
source: Please provide device IP
lt: Įveskite IP adresą

# mainGraphInfoTitle
source: Temparature and power graph
lt: Temperatūros ir galios grafikas

# mainGraphInfoText
source: Shows heater data of every {seconds} {seconds, plural, =1{second} other{seconds}} for {hours} {hours, plural, =1{hour} other{hours}}. Tap on graph points to see concrete values for that time.
lt: Grafike rodomi kaitintuvo duomenys {hours} {hours, plural, =1{valandos} other{valandų}}, kas {seconds} {seconds, plural, =1{sekundę} other{sekundžių}}. Spausdami ant grafiko taškų, pamatysite detalesnius to laiko duomenis.

# mainGraphInfoLegend
source: Line legends
lt: Linijų legenda

# heaterControlIncreaseTemperature
source: Increase temperature
lt: Padininti temperatūrą

# heaterControlDecreaseTemperature
source: Decrease temperature
lt: Sumažinti temperatūrą

# heaterControlIncreasePower
source: Increase power
lt: Padidinti galią

# heaterControlDecreasePower
source: Decrease power
lt: Sumažinti galią

# heaterControlCardLabelIdle
source: Idle
lt: Ramybės būsena

# heaterControlCardLabelAutotune
source: Autotuning...
lt: Automatinis PID derinimas

# heaterControlCardLabelError
source: Error occurred
lt: Įvyko klaida

# heaterControlCardMessageError
source: An error has occurred in the heater controller, try rebooting both controllers
lt: Įvyko klaida virintuvo valdiklyje, pabandykite perkraukite valdiklius.

# heaterControlCardLabelStatusUnknown
source: Unknown status
lt: Statusas nežinomas

# heaterControlCardMessageStatusUnknown
source: An error occurred - the status of the boiler controller is unknown, try reloading the application and both controllers.
lt: Įvyko klaida - virintuvo valdiklio būsena nežinoma, pabandykite perkrauti aplikaciją ir abu valdiklius.

# heaterControlCardLabelConfiguring
source: Configuring...
lt: Konfigūruojama...

# heaterControlCardMessageConfiguring
source: Waiting for the heater controller to be configured. This should take a few seconds.
lt: Laukiama, kol bus sukonfigūruotas virintuvo valdiklis. Tai turėtų užtrukti kelias sekundes.

# heaterControlSelectButtonLabel
source: {mode, select, idle {Idle} heating_manual {Power} heating_pid {Temperature} other {Unknown}}
lt: {mode, select, idle {Ramybės būsena} heating_manual {Galia} heating_pid {Temperatūra} other {Nežinoma}}

# heaterControlSelectButtonTooltip
source: Heating mode - {mode, select, idle {idle} heating_manual {manual} heating_pid {PID} autotune_pid {autotune} null {none} other {unknown}}
lt: Kaitinimo būdas - {mode, select, idle {ramybės būsena} heating_manual {pastovi galia} heating_pid {PID} autotune_pid {automatinis derinimas} null {nėra} other {nežinoma}}

# sliderContainerDragTooltip
source: Drag to change value
lt: Tempkite, kad pakeistumėte vertę

# devicesCommunicationController
source: Communication controller
lt: Komunikacijos valdiklis

# devicesSecureVersion
source: Secure version
lt: Saugi versija

# devicesCompileTime
source: Compile time
lt: Kompiliavimo laikas

# devicesScreenshot
source: Device screenshot
lt: Ekrano vaizdas

# devicesScreenshotRefreshTooltip
source: Refresh screenshot
lt: Atnaujinti ekrano vaizdą

# devicesCommunicationLog
source: Communication log
lt: Komunikacijos išrašas

# devicesShowMoreLogTooltip
source: Show all log messages
lt: Rodyti visas žinutes

# devicesHeaterController
source: Heater controller
lt: Virintuvo valdiklis

# devicesPid
source: PID
lt: PID reguliatorius

# devicesPidProportionalGain
source: Proportional gain
lt: Perdavimo koeficientas

# devicesPidIntegralGain
source: Integral gain
lt: Integruojančios grandies laiko konstanta

# devicesPidDerivativeGain
source: Derivative gain
lt: Diferencijuojančios grandies laiko konstanta

# devicesFormHelperText
source: Maximum value is {value}
lt: Maksimali galima reikšmė {value}

# settingsTitle
source: Settings
lt: Nustatymai

# settingsSectionGeneralTitle
source: General
lt: Bendri

# settingsLanguage
source: Language
lt: Kalba

# languageSelectDialogTitle
source: Select language
lt: Pasirinkite kalbą

# settingsInputLanguage
source: {locale, select, lt {Lithuanian} en {English} lv {Latvian} other {unknown}}
lt: {locale, select, lt {Lietuvių} en {Anglų} lv {Latvių} other {nežinoma}}

# settingsTheme
source: Theme
lt: Tema

# themeSelectDialogTitle
source: Select theme
lt: Pasirinkite temą

# settingsThemeNames
source: {theme, select, light {Light} lightMediumContrast {Light - medium contrast} lightHighContrast {Light - high contrast} dark {Dark} darkMediumContrast {Dark - medium contrast} darkHighContrast {Dark - high contrast} system {Same as device's} other {unknown}}
lt: {theme, select, light {Šviesi} lightMediumContrast {Šviesi - vidutinio kontrasto} lightHighContrast {Šviesi - didelio kontrasto} dark {Tamsi} darkMediumContrast {Tamsi - vidutinio kontrasto} darkHighContrast {Tamsi - didelio kontrasto} system {Pagal įrenginio temą} other {Nežinoma tema}}

# settingsAdvancedMode
source: Advanced mode
lt: Išplėstinė režimas

# settingsAdvancedModeTooltip
source: Turns on some debugging features
lt: Įjungus bus pasiekiamas funkcionalumas, skirtas programos derinimui ir testavimui.

# layoutItemHome
source: Home
lt: Pagrindinis

# layoutItemDevices
source: Devices
lt: Įrenginiai

# layoutItemSettings
source: Settings
lt: Nustatymai

# notFoundText
source: Not found
lt: Puslapis nerastas

# infoScreenTitle
source: Information
lt: Informacija

# aboutTitle
source: About
lt: Apie

# faqTitle
source: Frequently asked questions
lt: Dažniausiai užduodami klausimai

# faqQuestion1
source: Question 1: Lorem ipsum dolor sit amet, consectetur adipiscing elit
lt: Klausimas 1

# faqAnswer1
source: Answer 1: Aliquam eget sagittis nisl, id congue ipsum
lt: Atsakymas 1

# faqQuestion2
source: Question 2: Etiam faucibus velit ut tellus dapibus, vel lobortis elit consectetur
lt: Klausimas 2

# faqAnswer2
source: Answer 2: Nulla leo velit, euismod eget dapibus sit amet, aliquet vitae turpis
lt: Atsakymas 2

# faqQuestion3
source: Question 3: Suspendisse hendrerit, orci in maximus congue, metus mi tristique orci
lt: Klausimas 3

# faqAnswer3
source: Answer 3: id venenatis ante libero nec felis
lt: Atsakymas 3

# faqQuestion4
source: Question 4: Aliquam ultricies massa ut porta tempor
lt: Klausimas 4

# faqAnswer4
source: Answer 4: Etiam suscipit diam vel urna interdum placerat
lt: Atsakymas 4

# faqQuestion5
source: Question 5: Nullam id tempor nibh.
lt: Klausimas 5

# faqAnswer5
source: Answer 5: Cras mollis odio fermentum magna efficitur
lt: Atsakymas 5
